<font size="5">**Imports**<font>

In [2]:
#Imports
!pip install mysql-connector-python

import pandas as pd
import numpy as np
import os, time,json
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib as mpl

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy import create_engine
import mysql.connector

import warnings
warnings.filterwarnings('ignore')

Requirement already satisfied: mysql-connector-python in /opt/homebrew/Caskroom/miniforge/base/envs/dojo-env/lib/python3.9/site-packages (8.0.33)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in /opt/homebrew/Caskroom/miniforge/base/envs/dojo-env/lib/python3.9/site-packages (from mysql-connector-python) (3.19.6)

<font size="3">**Loading the Data**<font>

In [3]:
basics = pd.read_csv('Data/title_basics.csv.gz')
rating = pd.read_csv('Data/title_ratings.csv.gz')
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [4]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [5]:
rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2622
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [6]:
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.111,2247.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.099,186.0,R
3,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,239.0,NaN
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R

In [7]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 639 entries, 0 to 638
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                639 non-null    object
 1   adult                  639 non-null    float64
 2   backdrop_path          541 non-null    object
 3   belongs_to_collection  111 non-null    object
 4   budget                 639 non-null    float64
 5   genres                 639 non-null    object
 6   homepage               76 non-null     object
 7   id                     639 non-null    float64
 8   original_language      639 non-null    object
 9   original_title         639 non-null    object
 10  overview               637 non-null    object
 11  popularity             639 non-null    float64
 12  poster_path            621 non-null    object
 13  production_companies   639 non-null    object
 14  production_countries   639 non-null    object
 15  release_date           638 non-null    object
 16  revenue                639 non-null    float64
 17  runtime                639 non-null    float64
 18  spoken_languages       639 non-null    object
 19  status                 639 non-null    object
 20  tagline                501 non-null    object
 21  title                  639 non-null    object
 22  video                  639 non-null    float64
 23  vote_average           639 non-null    float64
 24  vote_count             639 non-null    float64
 25  certification          430 non-null    object
dtypes: float64(9), object(17)
memory usage: 129.9+ KB

**Requested Colums/Files**

**title_basics**

Movie ID (tconst)

Primary Title

Start Year

Runtime (in Minutes)

Genre

In [8]:
basics = basics[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes',
                      'genres']]
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

**tmdb_results**

Movie ID (tconst)

Revenue

Budget

Certification(MPAA Rating)

In [9]:
tmdb = tmdb[['imdb_id', 'budget', 'revenue', 'certification']]
tmdb

       imdb_id      budget      revenue certification
0    tt0113026  10000000.0          0.0           NaN
1    tt0118694    150000.0   14204632.0            PG
2    tt0119273  15000000.0          0.0             R
3    tt0120263         0.0      80334.0           NaN
4    tt0120467    120000.0      14904.0             R
..         ...         ...          ...           ...
634  tt0445841  12500000.0  123021750.0           NaN
635  tt0867181      5000.0          0.0           NaN
636  tt1039952    500000.0     500000.0           NaN
637  tt1764172    250000.0          0.0           NaN
638  tt2957918      2000.0          0.0           NaN

[639 rows x 4 columns]

**Remove rows of empty data**

In [10]:
tmdb.drop(0, axis = 'index', inplace=True)

In [13]:
tmdb[tmdb['imdb_id'] == '0']

Empty DataFrame
Columns: [imdb_id, budget, revenue, certification]
Index: []

In [14]:
tmdb.reset_index(drop=True).head()

     imdb_id      budget     revenue certification
0  tt0118694    150000.0  14204632.0            PG
1  tt0119273  15000000.0         0.0             R
2  tt0120263         0.0     80334.0           NaN
3  tt0120467    120000.0     14904.0             R
4  tt0120626   6105121.0         0.0           NaN

<font size="5">**Normalizing**<font>

**Title Basics**

In [16]:
#Create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...
81835,tt9914942,Life Without Sara Amat,2019.0,NaN,74,Drama,[Drama]
81836,tt9915872,The Last White Witch,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81837,tt9916170,The Rehearsal,2019.0,NaN,51,Drama,[Drama]
81838,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81839,tt9916362,Coven,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [17]:
explodedgenres = basics.explode('genres_split')
explodedgenres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",Drama
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...
81838,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81838,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81838,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81839,tt9916362,Coven,2020.0,NaN,92,"Drama,History",Drama
81839,tt9916362,Coven,2020.0,NaN,92,"Drama,History",History

In [19]:
uniquegenres = sorted(explodedgenres['genres_split'].unique())
uniquegenres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

**Save title_genres as df to use as Table**

In [21]:
#Save just tconst and genres_split as new df
titlegenresdata = explodedgenres[['tconst','genres_split']].copy()
titlegenresdata.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

**Create a dictionary for Genre**

In [22]:
#Making the genre mapper dictionary
genre = range(len(uniquegenres))
genremap = dict(zip(uniquegenres, genre))
genremap

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [24]:
#Make new integer genre_id and drop string genres
titlegenresdata['genre_id'] = titlegenresdata['genres_split'].map(genremap)
titlegenresdata.head()

      tconst genres_split  genre_id
0  tt0035423       Comedy         5
0  tt0035423      Fantasy         9
0  tt0035423      Romance        18
1  tt0043139        Drama         7
1  tt0043139      History        11

In [25]:
#Drop the genres_split column
titlegenresdata = titlegenresdata.drop(columns= 'genres_split')

In [26]:
titlegenresdata.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

In [27]:
#Manually make Dataframe with names cols from the .keyd and .values
genrelook = pd.DataFrame({'genre_name':genremap.keys(),
                            'genre_id':genremap.values()})
genrelook.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

<font size="5">**Saving the tables to MySQL**<font>

In [28]:
import json
with open('/Users/benjaminengel/Documents/.Secret/sql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [31]:
#Create a connection string using credentials following this format:
#connection = "dialect+driver://username:password@host:port/database"
databasename = "movies"
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/{databasename}"

In [32]:
#Create an instance of the sqlalchemy Engine Class 
engine = create_engine(connection_str)

In [33]:
create_database(connection)

**Create requested SQL Tables**

title_basics SQL

In [34]:
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70,Drama,[Drama]
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122,Drama,[Drama]
4,tt0088751,The Naked Monster,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"

In [35]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81840 entries, 0 to 81839
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81840 non-null  object
 1   primaryTitle    81840 non-null  object
 2   startYear       81840 non-null  float64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81840 non-null  int64
 5   genres          81840 non-null  object
 6   genres_split    81840 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 4.4+ MB

In [36]:
basics = basics[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes']]
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
3,tt0069049,The Other Side of the Wind,2018.0,NaN,122
4,tt0088751,The Naked Monster,2005.0,NaN,100

In [37]:
#Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
#Create a schema dictonary using Sqlalchemy datatype objects
basicsschema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [38]:
# ave to sql with dtype and index=False
basics.to_sql('title_basics',engine,
                 dtype = basicsschema,
                 if_exists='replace',index=False)

81840

In [39]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [40]:
data = genremap
genres = pd.DataFrame(data.items(), columns = ['genre_name', 'genre_id'])
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [41]:
q = """

SELECT *
FROM title_basics
LIMIT 10;

"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100
5,tt0096056,Crime and Punishment,2002.0,None,126
6,tt0100275,The Wandering Soap Opera,2017.0,None,80
7,tt0103340,Life for Life: Maximilian Kolbe,2006.0,None,90
8,tt0108549,West from North Goes South,2004.0,None,96
9,tt0113026,The Fantasticks,2000.0,None,86

title_ratings

In [43]:
rating.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2622
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [44]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502724 entries, 0 to 502723
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502724 non-null  object
 1   averageRating  502724 non-null  float64
 2   numVotes       502724 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [45]:
#Calculate max string lengths for object columns
key_len = rating['tconst'].fillna('').map(len).max()
#Create a schema dictonary using Sqlalchemy datatype objects
ratingschema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [47]:
#Save to sql with dtype and index=False
rating.to_sql('title_ratings',
                 engine,
                 dtype=ratingschema,
                 if_exists='replace', index=False)

502724

In [48]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [49]:
r = """

SELECT *
FROM title_ratings
LIMIT 5;

"""

pd.read_sql(r, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2622
3  tt0000006            5.1       182
4  tt0000007            5.4       820

title_genres

In [50]:
titlegenresdata.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

In [51]:
titlegenresdata.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153356 entries, 0 to 81839
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153356 non-null  object
 1   genre_id  153356 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [52]:
#Calculate max string lengths for object columns
key_len = titlegenresdata['tconst'].fillna('').map(len).max()
#Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1), 
    "genre_id": Integer()}

In [53]:
# Save to sql with dtype and index=False
titlegenresdata.to_sql('title_genres',
                 engine,
                 dtype=title_genres_schema,
                 if_exists='replace', index=False)

153356

In [54]:
t = """

SELECT *
FROM title_genres
LIMIT 5;

"""

pd.read_sql(t, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0043139         7
4  tt0043139        11

Genres

In [56]:
#Save to sql with dtype and index=False
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  25 non-null     object
 1   genre_id    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [57]:
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [58]:
##Calculate max string lengths for object columns
text_len = genres['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    'genre_id':Integer(),
    "genre_name": Text(key_len+1)
    }

In [59]:
# Save to sql with dtype and index=False
genres.to_sql('genres',
                 engine,
                 dtype=genres_schema,
                 if_exists='replace', index=False)

25

In [60]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [61]:
g = """

SELECT *
FROM genres
LIMIT 5;

"""

pd.read_sql(g, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

tmdb

In [62]:
tmdb.head()

     imdb_id      budget     revenue certification
1  tt0118694    150000.0  14204632.0            PG
2  tt0119273  15000000.0         0.0             R
3  tt0120263         0.0     80334.0           NaN
4  tt0120467    120000.0     14904.0             R
5  tt0120626   6105121.0         0.0           NaN

In [63]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 638 entries, 1 to 638
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        638 non-null    object
 1   budget         638 non-null    float64
 2   revenue        638 non-null    float64
 3   certification  430 non-null    object
dtypes: float64(2), object(2)
memory usage: 20.1+ KB

In [64]:
## Calculate max string lengths for object columns
key_len = tmdb['imdb_id'].fillna('').map(len).max()
title_len = tmdb['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'budget':Float(),
    'revenue':Float()}

In [65]:
# Save to sql with dtype and index=False
tmdb.to_sql('tmdb_data',
                 engine,
                 dtype=tmdb_schema,
                 if_exists='replace', index=False)

638

In [66]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [67]:
t = """

SELECT *
FROM tmdb_data
LIMIT 5;

"""

pd.read_sql(t, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0118589  22000000.0   5271670.0         PG-13
2  tt0118652   1000000.0         0.0             R
3  tt0118694    150000.0  14204600.0            PG
4  tt0119004         0.0      6297.0          None

**Show Tables**

In [68]:
tables = """

SHOW TABLES;

"""

pd.read_sql(tables, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data